create_clock [get_ports clk] -name clk -period 50 -waveform {0 25}
set_input_delay 0 -clock clk  [get_ports {clk rst image_net_rsc_data_out* image_floue_rsc_data_out* image_error_rsc_data_out*}]
set_input_delay 0 -clock clk  [get_ports rst]
set_input_delay 1.57 -clock clk  [get_ports image_net_rsc_data_out*]
set_input_delay 1.57 -clock clk  [get_ports image_floue_rsc_data_out*]
set_input_delay 1.57 -clock clk  [get_ports image_error_rsc_data_out*]
set_output_delay 0 -clock clk  [get_ports {image_net_rsc_re image_net_rsc_triosy_lz image_floue_rsc_re image_floue_rsc_triosy_lz image_error_rsc_re image_error_rsc_we image_error_rsc_triosy_lz image_net_rsc_addr* image_floue_rsc_addr* image_error_rsc_data_in* image_error_rsc_addr* depth_rsc_* return_rsc_*}]
set_output_delay 0 -clock clk  [get_ports image_net_rsc_addr*]
set_output_delay 0 -clock clk  [get_ports image_net_rsc_re]
set_output_delay 0 -clock clk  [get_ports image_net_rsc_triosy_lz]
set_output_delay 0 -clock clk  [get_ports image_floue_rsc_addr*]
set_output_delay 0 -clock clk  [get_ports image_floue_rsc_re]
set_output_delay 0 -clock clk  [get_ports image_floue_rsc_triosy_lz]
set_output_delay 0 -clock clk  [get_ports image_error_rsc_data_in*]
set_output_delay 0 -clock clk  [get_ports image_error_rsc_addr*]
set_output_delay 0 -clock clk  [get_ports image_error_rsc_re]
set_output_delay 0 -clock clk  [get_ports image_error_rsc_we]
set_output_delay 0 -clock clk  [get_ports image_error_rsc_triosy_lz]
set_output_delay 0 -clock clk  [get_ports depth_rsc_data_in*]
set_output_delay 0 -clock clk  [get_ports depth_rsc_addr*]
set_output_delay 0 -clock clk  [get_ports depth_rsc_we]
set_output_delay 0 -clock clk  [get_ports depth_rsc_triosy_lz]
set_output_delay 0 -clock clk  [get_ports return_rsc_z*]
set_output_delay 0 -clock clk  [get_ports return_rsc_triosy_lz]
set_clock_uncertainty [get_clocks clk]
