###################################################################################
# Mentor Graphics Corporation
#
###################################################################################


##########
# Clocks #
##########
create_clock [get_ports clk] -name clk -domain xmplr_ClockDomain_clk -period 50 -waveform {0 25} -constraint_source user

###############
# Input Delay #
###############
set_input_delay 0 -clock clk  [get_ports {clk cols_rsc_z(0) cols_rsc_z(1) cols_rsc_z(10) cols_rsc_z(11) cols_rsc_z(12) cols_rsc_z(13) cols_rsc_z(14) cols_rsc_z(15) cols_rsc_z(16) cols_rsc_z(17) cols_rsc_z(18) cols_rsc_z(19) cols_rsc_z(2) cols_rsc_z(20) cols_rsc_z(21) cols_rsc_z(22) cols_rsc_z(23) cols_rsc_z(24) cols_rsc_z(25) cols_rsc_z(26) cols_rsc_z(27) cols_rsc_z(28) cols_rsc_z(29) cols_rsc_z(3) cols_rsc_z(30) cols_rsc_z(31) cols_rsc_z(4) cols_rsc_z(5) cols_rsc_z(6) cols_rsc_z(7) cols_rsc_z(8) cols_rsc_z(9) image_rsc_data_out(0) image_rsc_data_out(1) image_rsc_data_out(10) image_rsc_data_out(11) image_rsc_data_out(12) image_rsc_data_out(13) image_rsc_data_out(14) image_rsc_data_out(15) image_rsc_data_out(16) image_rsc_data_out(17) image_rsc_data_out(18) image_rsc_data_out(19) image_rsc_data_out(2) image_rsc_data_out(20) image_rsc_data_out(21) image_rsc_data_out(22) image_rsc_data_out(23) image_rsc_data_out(24) image_rsc_data_out(25) image_rsc_data_out(26) image_rsc_data_out(27) image_rsc_data_out(28) image_rsc_data_out(29) image_rsc_data_out(3) image_rsc_data_out(30) image_rsc_data_out(31) image_rsc_data_out(4) image_rsc_data_out(5) image_rsc_data_out(6) image_rsc_data_out(7) image_rsc_data_out(8) image_rsc_data_out(9) kernel_rsc_data_out(0) kernel_rsc_data_out(1) kernel_rsc_data_out(10) kernel_rsc_data_out(11) kernel_rsc_data_out(12) kernel_rsc_data_out(13) kernel_rsc_data_out(14) kernel_rsc_data_out(15) kernel_rsc_data_out(16) kernel_rsc_data_out(17) kernel_rsc_data_out(18) kernel_rsc_data_out(19) kernel_rsc_data_out(2) kernel_rsc_data_out(20) kernel_rsc_data_out(21) kernel_rsc_data_out(22) kernel_rsc_data_out(23) kernel_rsc_data_out(24) kernel_rsc_data_out(25) kernel_rsc_data_out(26) kernel_rsc_data_out(27) kernel_rsc_data_out(28) kernel_rsc_data_out(29) kernel_rsc_data_out(3) kernel_rsc_data_out(30) kernel_rsc_data_out(31) kernel_rsc_data_out(4) kernel_rsc_data_out(5) kernel_rsc_data_out(6) kernel_rsc_data_out(7) kernel_rsc_data_out(8) kernel_rsc_data_out(9) rows_rsc_z(0) rows_rsc_z(1) rows_rsc_z(10) rows_rsc_z(11) rows_rsc_z(12) rows_rsc_z(13) rows_rsc_z(14) rows_rsc_z(15) rows_rsc_z(16) rows_rsc_z(17) rows_rsc_z(18) rows_rsc_z(19) rows_rsc_z(2) rows_rsc_z(20) rows_rsc_z(21) rows_rsc_z(22) rows_rsc_z(23) rows_rsc_z(24) rows_rsc_z(25) rows_rsc_z(26) rows_rsc_z(27) rows_rsc_z(28) rows_rsc_z(29) rows_rsc_z(3) rows_rsc_z(30) rows_rsc_z(31) rows_rsc_z(4) rows_rsc_z(5) rows_rsc_z(6) rows_rsc_z(7) rows_rsc_z(8) rows_rsc_z(9) rst sortie_rsc_data_out(0) sortie_rsc_data_out(1) sortie_rsc_data_out(10) sortie_rsc_data_out(11) sortie_rsc_data_out(12) sortie_rsc_data_out(13) sortie_rsc_data_out(14) sortie_rsc_data_out(15) sortie_rsc_data_out(16) sortie_rsc_data_out(17) sortie_rsc_data_out(18) sortie_rsc_data_out(19) sortie_rsc_data_out(2) sortie_rsc_data_out(20) sortie_rsc_data_out(21) sortie_rsc_data_out(22) sortie_rsc_data_out(23) sortie_rsc_data_out(24) sortie_rsc_data_out(25) sortie_rsc_data_out(26) sortie_rsc_data_out(27) sortie_rsc_data_out(28) sortie_rsc_data_out(29) sortie_rsc_data_out(3) sortie_rsc_data_out(30) sortie_rsc_data_out(31) sortie_rsc_data_out(4) sortie_rsc_data_out(5) sortie_rsc_data_out(6) sortie_rsc_data_out(7) sortie_rsc_data_out(8) sortie_rsc_data_out(9)}] -constraint_source user
set_input_delay 0 -clock clk  [get_ports rst] -constraint_source user
set_input_delay 1.85 -clock clk  [get_ports {image_rsc_data_out(0) image_rsc_data_out(1) image_rsc_data_out(10) image_rsc_data_out(11) image_rsc_data_out(12) image_rsc_data_out(13) image_rsc_data_out(14) image_rsc_data_out(15) image_rsc_data_out(16) image_rsc_data_out(17) image_rsc_data_out(18) image_rsc_data_out(19) image_rsc_data_out(2) image_rsc_data_out(20) image_rsc_data_out(21) image_rsc_data_out(22) image_rsc_data_out(23) image_rsc_data_out(24) image_rsc_data_out(25) image_rsc_data_out(26) image_rsc_data_out(27) image_rsc_data_out(28) image_rsc_data_out(29) image_rsc_data_out(3) image_rsc_data_out(30) image_rsc_data_out(31) image_rsc_data_out(4) image_rsc_data_out(5) image_rsc_data_out(6) image_rsc_data_out(7) image_rsc_data_out(8) image_rsc_data_out(9)}] -constraint_source user
set_input_delay 0 -clock clk  [get_ports {rows_rsc_z(0) rows_rsc_z(1) rows_rsc_z(10) rows_rsc_z(11) rows_rsc_z(12) rows_rsc_z(13) rows_rsc_z(14) rows_rsc_z(15) rows_rsc_z(16) rows_rsc_z(17) rows_rsc_z(18) rows_rsc_z(19) rows_rsc_z(2) rows_rsc_z(20) rows_rsc_z(21) rows_rsc_z(22) rows_rsc_z(23) rows_rsc_z(24) rows_rsc_z(25) rows_rsc_z(26) rows_rsc_z(27) rows_rsc_z(28) rows_rsc_z(29) rows_rsc_z(3) rows_rsc_z(30) rows_rsc_z(31) rows_rsc_z(4) rows_rsc_z(5) rows_rsc_z(6) rows_rsc_z(7) rows_rsc_z(8) rows_rsc_z(9)}] -constraint_source user
set_input_delay 0 -clock clk  [get_ports {cols_rsc_z(0) cols_rsc_z(1) cols_rsc_z(10) cols_rsc_z(11) cols_rsc_z(12) cols_rsc_z(13) cols_rsc_z(14) cols_rsc_z(15) cols_rsc_z(16) cols_rsc_z(17) cols_rsc_z(18) cols_rsc_z(19) cols_rsc_z(2) cols_rsc_z(20) cols_rsc_z(21) cols_rsc_z(22) cols_rsc_z(23) cols_rsc_z(24) cols_rsc_z(25) cols_rsc_z(26) cols_rsc_z(27) cols_rsc_z(28) cols_rsc_z(29) cols_rsc_z(3) cols_rsc_z(30) cols_rsc_z(31) cols_rsc_z(4) cols_rsc_z(5) cols_rsc_z(6) cols_rsc_z(7) cols_rsc_z(8) cols_rsc_z(9)}] -constraint_source user
set_input_delay 1.85 -clock clk  [get_ports {kernel_rsc_data_out(0) kernel_rsc_data_out(1) kernel_rsc_data_out(10) kernel_rsc_data_out(11) kernel_rsc_data_out(12) kernel_rsc_data_out(13) kernel_rsc_data_out(14) kernel_rsc_data_out(15) kernel_rsc_data_out(16) kernel_rsc_data_out(17) kernel_rsc_data_out(18) kernel_rsc_data_out(19) kernel_rsc_data_out(2) kernel_rsc_data_out(20) kernel_rsc_data_out(21) kernel_rsc_data_out(22) kernel_rsc_data_out(23) kernel_rsc_data_out(24) kernel_rsc_data_out(25) kernel_rsc_data_out(26) kernel_rsc_data_out(27) kernel_rsc_data_out(28) kernel_rsc_data_out(29) kernel_rsc_data_out(3) kernel_rsc_data_out(30) kernel_rsc_data_out(31) kernel_rsc_data_out(4) kernel_rsc_data_out(5) kernel_rsc_data_out(6) kernel_rsc_data_out(7) kernel_rsc_data_out(8) kernel_rsc_data_out(9)}] -constraint_source user
set_input_delay 1.85 -clock clk  [get_ports {sortie_rsc_data_out(0) sortie_rsc_data_out(1) sortie_rsc_data_out(10) sortie_rsc_data_out(11) sortie_rsc_data_out(12) sortie_rsc_data_out(13) sortie_rsc_data_out(14) sortie_rsc_data_out(15) sortie_rsc_data_out(16) sortie_rsc_data_out(17) sortie_rsc_data_out(18) sortie_rsc_data_out(19) sortie_rsc_data_out(2) sortie_rsc_data_out(20) sortie_rsc_data_out(21) sortie_rsc_data_out(22) sortie_rsc_data_out(23) sortie_rsc_data_out(24) sortie_rsc_data_out(25) sortie_rsc_data_out(26) sortie_rsc_data_out(27) sortie_rsc_data_out(28) sortie_rsc_data_out(29) sortie_rsc_data_out(3) sortie_rsc_data_out(30) sortie_rsc_data_out(31) sortie_rsc_data_out(4) sortie_rsc_data_out(5) sortie_rsc_data_out(6) sortie_rsc_data_out(7) sortie_rsc_data_out(8) sortie_rsc_data_out(9)}] -constraint_source user

################
# Output Delay #
################
set_output_delay 0 -clock clk  [get_ports {cols_rsc_triosy_lz image_rsc_addr(0) image_rsc_addr(1) image_rsc_addr(10) image_rsc_addr(11) image_rsc_addr(12) image_rsc_addr(13) image_rsc_addr(14) image_rsc_addr(15) image_rsc_addr(2) image_rsc_addr(3) image_rsc_addr(4) image_rsc_addr(5) image_rsc_addr(6) image_rsc_addr(7) image_rsc_addr(8) image_rsc_addr(9) image_rsc_re image_rsc_triosy_lz kernel_rsc_addr(0) kernel_rsc_addr(1) kernel_rsc_addr(2) kernel_rsc_addr(3) kernel_rsc_addr(4) kernel_rsc_addr(5) kernel_rsc_addr(6) kernel_rsc_addr(7) kernel_rsc_addr(8) kernel_rsc_re kernel_rsc_triosy_lz rows_rsc_triosy_lz sortie_rsc_addr(0) sortie_rsc_addr(1) sortie_rsc_addr(10) sortie_rsc_addr(11) sortie_rsc_addr(12) sortie_rsc_addr(13) sortie_rsc_addr(14) sortie_rsc_addr(15) sortie_rsc_addr(16) sortie_rsc_addr(2) sortie_rsc_addr(3) sortie_rsc_addr(4) sortie_rsc_addr(5) sortie_rsc_addr(6) sortie_rsc_addr(7) sortie_rsc_addr(8) sortie_rsc_addr(9) sortie_rsc_data_in(0) sortie_rsc_data_in(1) sortie_rsc_data_in(10) sortie_rsc_data_in(11) sortie_rsc_data_in(12) sortie_rsc_data_in(13) sortie_rsc_data_in(14) sortie_rsc_data_in(15) sortie_rsc_data_in(16) sortie_rsc_data_in(17) sortie_rsc_data_in(18) sortie_rsc_data_in(19) sortie_rsc_data_in(2) sortie_rsc_data_in(20) sortie_rsc_data_in(21) sortie_rsc_data_in(22) sortie_rsc_data_in(23) sortie_rsc_data_in(24) sortie_rsc_data_in(25) sortie_rsc_data_in(26) sortie_rsc_data_in(27) sortie_rsc_data_in(28) sortie_rsc_data_in(29) sortie_rsc_data_in(3) sortie_rsc_data_in(30) sortie_rsc_data_in(31) sortie_rsc_data_in(4) sortie_rsc_data_in(5) sortie_rsc_data_in(6) sortie_rsc_data_in(7) sortie_rsc_data_in(8) sortie_rsc_data_in(9) sortie_rsc_re sortie_rsc_triosy_lz sortie_rsc_we}] -constraint_source user
set_output_delay 0 -clock clk  [get_ports {image_rsc_addr(0) image_rsc_addr(1) image_rsc_addr(10) image_rsc_addr(11) image_rsc_addr(12) image_rsc_addr(13) image_rsc_addr(14) image_rsc_addr(15) image_rsc_addr(2) image_rsc_addr(3) image_rsc_addr(4) image_rsc_addr(5) image_rsc_addr(6) image_rsc_addr(7) image_rsc_addr(8) image_rsc_addr(9)}] -constraint_source user
set_output_delay 0 -clock clk  [get_ports image_rsc_re] -constraint_source user
set_output_delay 0 -clock clk  [get_ports image_rsc_triosy_lz] -constraint_source user
set_output_delay 0 -clock clk  [get_ports rows_rsc_triosy_lz] -constraint_source user
set_output_delay 0 -clock clk  [get_ports cols_rsc_triosy_lz] -constraint_source user
set_output_delay 0 -clock clk  [get_ports {kernel_rsc_addr(0) kernel_rsc_addr(1) kernel_rsc_addr(2) kernel_rsc_addr(3) kernel_rsc_addr(4) kernel_rsc_addr(5) kernel_rsc_addr(6) kernel_rsc_addr(7) kernel_rsc_addr(8)}] -constraint_source user
set_output_delay 0 -clock clk  [get_ports kernel_rsc_re] -constraint_source user
set_output_delay 0 -clock clk  [get_ports kernel_rsc_triosy_lz] -constraint_source user
set_output_delay 0 -clock clk  [get_ports {sortie_rsc_data_in(0) sortie_rsc_data_in(1) sortie_rsc_data_in(10) sortie_rsc_data_in(11) sortie_rsc_data_in(12) sortie_rsc_data_in(13) sortie_rsc_data_in(14) sortie_rsc_data_in(15) sortie_rsc_data_in(16) sortie_rsc_data_in(17) sortie_rsc_data_in(18) sortie_rsc_data_in(19) sortie_rsc_data_in(2) sortie_rsc_data_in(20) sortie_rsc_data_in(21) sortie_rsc_data_in(22) sortie_rsc_data_in(23) sortie_rsc_data_in(24) sortie_rsc_data_in(25) sortie_rsc_data_in(26) sortie_rsc_data_in(27) sortie_rsc_data_in(28) sortie_rsc_data_in(29) sortie_rsc_data_in(3) sortie_rsc_data_in(30) sortie_rsc_data_in(31) sortie_rsc_data_in(4) sortie_rsc_data_in(5) sortie_rsc_data_in(6) sortie_rsc_data_in(7) sortie_rsc_data_in(8) sortie_rsc_data_in(9)}] -constraint_source user
set_output_delay 0 -clock clk  [get_ports {sortie_rsc_addr(0) sortie_rsc_addr(1) sortie_rsc_addr(10) sortie_rsc_addr(11) sortie_rsc_addr(12) sortie_rsc_addr(13) sortie_rsc_addr(14) sortie_rsc_addr(15) sortie_rsc_addr(16) sortie_rsc_addr(2) sortie_rsc_addr(3) sortie_rsc_addr(4) sortie_rsc_addr(5) sortie_rsc_addr(6) sortie_rsc_addr(7) sortie_rsc_addr(8) sortie_rsc_addr(9)}] -constraint_source user
set_output_delay 0 -clock clk  [get_ports sortie_rsc_re] -constraint_source user
set_output_delay 0 -clock clk  [get_ports sortie_rsc_we] -constraint_source user
set_output_delay 0 -clock clk  [get_ports sortie_rsc_triosy_lz] -constraint_source user

#####################
# Clock Uncertainty #
#####################
set_clock_uncertainty 0 [get_clocks clk]
